Revit 2027 API
PointOnEdgeEdgeIntersection.GetEdgeReference1 Method
Get a copy of the first edge or curve reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetEdgeReference1()
Public Function GetEdgeReference1 As Reference
public:
Reference^ GetEdgeReference1()
member GetEdgeReference1 : unit -> Reference
Return Value
Reference
See Also
Reference
PointOnEdgeEdgeIntersection Class
Autodesk.Revit.DB Namespace